#+TITLE: Perl 6 & chill
#+EMAIL: lloyd.fourn@gmail.com
#+AUTHOR: Lloyd Fournier

#+STARTUP: inlineimages

** DOOM
   The rate rise will put pressure on the financial system.

   Perl 6 will put thousands of Pascal's Triangle Engineers out of work.

   #+name: Pascal's Triangle
   #+begin_src perl6
   ([1], -> @prev { [0, |@prev Z+ |@prev, 0] } ... *)[^10].join("\n").say;
   #+end_src

   #+RESULTS: Pascal's Triangle
   #+begin_example
   1
   1 1
   1 2 1
   1 3 3 1
   1 4 6 4 1
   1 5 10 10 5 1
   1 6 15 20 15 6 1
   1 7 21 35 35 21 7 1
   1 8 28 56 70 56 28 8 1
   1 9 36 84 126 126 84 36 9 1
#+end_example

   We're doomed

*** But anyway
   We'll see if we can manage to chill.

   #+BEGIN_SRC perl6
   say "we are going to $*PERL & chill";
   #+END_SRC
   #+RESULTS:
   : we are going to Perl 6 & chill

** What that means

   I am going to show you examples of Perl 6 in these source blocks:

   #+begin_src perl6
   say $*PERL;
   #+end_src

   #+RESULTS:
   : Perl 6 (6.c)

   You are going to put forward queries and concerns.

   We will resolve them together (hopefully).

   ...And interject whatever you like.

*** Two at a time Perl 6
   But do easier in Perl 6.
   #+begin_src perl6
      my @array = ^10;

      for @array -> $one,$two {
          say "$one,$two";
      }

   #+end_src

   #+RESULTS:
   : 0,1
   : 2,3
   : 4,5
   : 6,7
   : 8,9

